# models/custom_yolov5s.yaml
nc: 1
width_multiple: 0.50  # Keep this for malaria (needs precision)
depth_multiple: 0.33  # Original
anchors:  # Adjusted for smaller cells
  - [4,5, 8,10, 12,15]    # P3/8
  - [15,20, 20,25, 25,30] # P4/16
  - [30,40, 40,50, 50,60] # P5/32

backbone:
  [[-1, 1, Conv, [64, 6, 2, 2]],   
   [-1, 1, Conv, [128, 3, 2]],     
   [-1, 1, C3TR, [128]],           
   [-1, 1, Conv, [256, 3, 2]],    
   [-1, 2, C3TR, [256]],          
   [-1, 1, Conv, [512, 3, 2]],     
   [-1, 3, C3TR, [512]],           
   [-1, 1, Conv, [1024, 3, 2]],   
   [-1, 1, C3TR, [1024]],         
   [-1, 1, SPPF, [1024, 5]],       
  ]
head:
  [[-1, 1, Conv, [512, 1, 1]],        # 10
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],         # 12
   [-1, 3, C3TR, [512, False]],       # 13
   [-1, 1, Conv, [256, 1, 1]],        # 14
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],         # 16
   [-1, 3, C3TR, [256, False]],       # 17
   [-1, 1, Conv, [256, 3, 2]],        # 18
   [[-1, 13], 1, Concat, [1]],        # 19
   [-1, 3, C3TR, [512, False]],       # 20
   [-1, 1, Conv, [512, 3, 2]],        # 21
   [[-1, 9], 1, Concat, [1]],         # 22
   [-1, 3, C3TR, [1024, False]],      # 23
   [[17, 20, 23], 1, Detect, [nc]],   # Detect (simplified)
  ]